[{"name": "Coldplay", "url": "https://www.last.fm/music/Coldplay", "image": "https://lastfm-img2.akamaized.net/i/u/174s/1eb194d3a56bdc8f1976eb279de62f74.png", "mbid_artist": "cc197bad-dc9c-440d-a5b5-d52ba2e14234", "summary": "Coldplay is a British alternative rock band, formed in London, United Kingdom in 1997. The band comprises vocalist and pianist Chris Martin, lead guitarist Jonny Buckland – who met each other in September 1996 at Ramsay Hall (halls of residence) at University College London - bassist Guy Berryman and drummer Will Champion.\n\nNot only have Coldplay had 7 highly successful studio album releases (all of which debuted at #1 on the UK album chart) - with their latest 7th studio album released on December 4 <a href=\"https://www.last.fm/music/Coldplay\">Read more on Last.fm</a>", "listeners": "5121222", "playcount": "333669265"}, {"name": "Sia", "url": "https://www.last.fm/music/Sia", "image": "https://lastfm-img2.akamaized.net/i/u/174s/f50a4513b8fa58373021c1b225de19cf.png", "mbid_artist": "2f548675-008d-4332-876c-108b0c7ab9c5", "summary": "Sia Kate Isobelle Furler (born 18 December 1975) or simply Sia, is an Australian pop, downtempo, and jazz singer and songwriter. In 2000, her single, \"Taken for Granted\" was a top 10 hit in the United Kingdom. Her 2008 album, Some People Have Real Problems peaked in the top 30 on the Billboard 200. At the ARIA Music Awards of 2009, she won the award for 'Best Music DVD' and received six nominations at the ARIA Music Awards of 2010 and won 'Best Independent <a href=\"https://www.last.fm/music/Sia\">Read more on Last.fm</a>", "listeners": "1833929", "playcount": "59909666"}, {"name": "Radiohead", "url": "https://www.last.fm/music/Radiohead", "image": "https://lastfm-img2.akamaized.net/i/u/174s/7bc5bd5689504cb4afd6b2ca4a4b3474.png", "mbid_artist": "a74b1b7f-71a5-4011-9441-d0b5e4122711", "summary": "Radiohead are an English alternative rock band from Abingdon, Oxfordshire, UK which formed in 1985. The band is composed of Thom Yorke (lead vocals, rhythm guitar, piano, beats), Jonny Greenwood (lead guitar, keyboard, other instruments), Ed O'Brien (guitar, backing vocals), Colin Greenwood (bass guitar) and Phil Selway (drums, percussion).\n\nThe early years (1992 – 1995)\nRadiohead released their first single, \"Creep\" in 1992. The song was initially unsuccessful <a href=\"https://www.last.fm/music/Radiohead\">Read more on Last.fm</a>", "listeners": "4502333", "playcount": "443686806"}, {"name": "Drake", "url": "https://www.last.fm/music/Drake", "image": "https://lastfm-img2.akamaized.net/i/u/174s/b65b489e580a3f4cdd4c06bac3dfc236.png", "mbid_artist": "b49b81cc-d5b7-4bdd-aadb-385df8de69a6", "summary": "Aubrey “Drake” Graham (born October 24, 1986 in Toronto, Ontario) is a Grammy award nominated Canadian actor, rapper and singer signed to Young Money/Universal Motown. Drake shot to global fame upon the release of his critically acclaimed 2009 mixtape So Far Gone and Best I Ever Had, a single from the mixtape which peaked at #2 on the Billboard Hot 100.\n\nDrake's music career began in 2006 with the release of his debut mixtape room for improvement. <a href=\"https://www.last.fm/music/Drake\">Read more on Last.fm</a>", "listeners": "3015096", "playcount": "96803682"}, {"name": "Twenty One Pilots", "url": "https://www.last.fm/music/Twenty+One+Pilots", "image": "https://lastfm-img2.akamaized.net/i/u/174s/f0da5af7de92c55996970aa3ac5da6d2.png", "mbid_artist": "a6c6897a-7415-4f8d-b5a5-3a5e05f3be67", "summary": "Twenty One Pilots is an American musical duo that originates from Columbus, Ohio. The band was formed in 2009 by Tyler Joseph along with former members Nick Thomas and Chris Salih, and currently consists of vocalist/keyboardist Tyler Joseph and drummer Josh Dun. They self-released two albums, Twenty One Pilots (2009) and Regional at Best (2011), before being signed by Fueled By Ramen in 2012. They released their signed debut, Vessel (2013) and second signed album, Blurryface (2015). <a href=\"https://www.last.fm/music/Twenty+One+Pilots\">Read more on Last.fm</a>", "listeners": "444585", "playcount": "19994435"}, {"name": "Rihanna", "url": "https://www.last.fm/music/Rihanna", "image": "https://lastfm-img2.akamaized.net/i/u/174s/80a07d9f99f2a63fafd975c545a6cfd4.png", "mbid_artist": "db36a76f-4cdf-43ac-8cd0-5e48092d2bae", "summary": "Robyn Rihanna Fenty (born February 20, 1988), known by her stage name, Rihanna, is a Bajan singer.  Her song Umbrella was one of the highest-selling songs of 2007 and her 3rd album Good Girl Gone Bad was critically acclaimed, helping propel her to superstar status. She has attained thirteen Billboard Hot 100 number ones thus far and is the second Bajan artist to win a Grammy Award. She is also a cultural ambassador for Barbados.\n\nRihanna was born in Saint Michael <a href=\"https://www.last.fm/music/Rihanna\">Read more on Last.fm</a>", "listeners": "4268182", "playcount": "172500388"}, {"name": "Major Lazer", "url": "https://www.last.fm/music/Major+Lazer", "image": "https://lastfm-img2.akamaized.net/i/u/174s/38871bbf7333a8ec94507e7a7dc7333a.png", "mbid_artist": "75be165a-ad83-4d12-bd28-f589a15c479f", "summary": "Years after the zombie apocalypse ravaged the galaxy, Major Lazer went into isolation after bringing peace and order to Earth. With the help of a mysterious shadow government called Cinco he was cryogenically frozen as a safeguard for the future’s wellbeing. Despite a great many years of pursuing peace on the planet, a new threat began to loom on the horizon and the commando was brought out of sleep by the Committee of Five. This intergalactic group <a href=\"https://www.last.fm/music/Major+Lazer\">Read more on Last.fm</a>", "listeners": "973078", "playcount": "22627321"}, {"name": "Red Hot Chili Peppers", "url": "https://www.last.fm/music/Red+Hot+Chili+Peppers", "image": "https://lastfm-img2.akamaized.net/i/u/174s/608c876efc5446a2882e3888e63df2c9.png", "mbid_artist": "8bfac288-ccc5-448d-9573-c33ea2aa5c30", "summary": "The Red Hot Chili Peppers are a funk rock band based in Hollywood, California and were formed in 1983, in Los Angeles, California. The band currently consists of founding members Anthony Kiedis (vocals) and Michael \"Flea\" Balzary (bass) along with a longtime member Chad Smith (drums). Guitarist John Frusciante quietly left the band on good terms in late 2008. On January 2, 2010, Josh Klinghoffer was announced as Frusciante's replacement.\n\nThe band initially formed for a one-off support act for a friend's band <a href=\"https://www.last.fm/music/Red+Hot+Chili+Peppers\">Read more on Last.fm</a>", "listeners": "4382693", "playcount": "268652810"}, {"name": "David Bowie", "url": "https://www.last.fm/music/David+Bowie", "image": "https://lastfm-img2.akamaized.net/i/u/174s/937d62bb145040b9b709319c1e680037.png", "mbid_artist": "5441c29d-3602-4898-b1a1-b77fa23b8e50", "summary": "David Bowie (born David Robert Jones on 8th January 1947 in Brixton, London, UK) was an English rock singer, songwriter, musician, and actor. Active during six decades of popular music and frequently reinventing his music and image, Bowie is widely regarded as an innovator, particularly for his work in the 1970s. Shortly after releasing his 25th studio album Blackstar, it was announced Bowie died on 10 January 2016, following an eighteen-month battle with cancer. <a href=\"https://www.last.fm/music/David+Bowie\">Read more on Last.fm</a>", "listeners": "3114052", "playcount": "163951262"}, {"name": "Kanye West", "url": "https://www.last.fm/music/Kanye+West", "image": "https://lastfm-img2.akamaized.net/i/u/174s/88d98c8135f200c8388ed0863c6fbb92.png", "mbid_artist": "164f0d73-1234-4e2c-8743-d77bf2191051", "summary": "Kanye Omari West (born June 8, 1977 in Atlanta, Georgia) is a Grammy award winning rapper, producer, author, designer and singer. \n\nHe began making beats and rapping in the early 90s in Chicago, IL, United States when he formed the rap group Go Getters with Chicago natives GLC and Really Doe. He later gained nationwide popularity in New York when he began producing tracks for artists such as Jay-Z, Twista, Mase, Talib Kweli and Alicia Keys. \n\nWest’s style of production often utilizes pitched-up vocal samples <a href=\"https://www.last.fm/music/Kanye+West\">Read more on Last.fm</a>", "listeners": "4085258", "playcount": "185423099"}, {"name": "The Beatles", "url": "https://www.last.fm/music/The+Beatles", "image": "https://lastfm-img2.akamaized.net/i/u/174s/758cade4517c48a3850cfdb6c4d5e43d.png", "mbid_artist": "b10bbbfc-cf9e-42e0-be17-e2c3e1d2600d", "summary": "The Beatles were an iconic rock group from Liverpool, England. They are frequently cited as the most commercially successful and critically acclaimed band in modern history, with innovative music, a cultural impact that helped define the 1960s and an enormous influence on music that is still felt today. Currently, The Beatles are one of the two musical acts to sell more than 1 billion records, with only Elvis Presley having been able to achieve the same feat. <a href=\"https://www.last.fm/music/The+Beatles\">Read more on Last.fm</a>", "listeners": "3399169", "playcount": "470347236"}, {"name": "Calvin Harris", "url": "https://www.last.fm/music/Calvin+Harris", "image": "https://lastfm-img2.akamaized.net/i/u/174s/83e711b03adc480fc834a6b18627c57b.png", "mbid_artist": "8dd98bdc-80ec-4e93-8509-2f46bafc09a7", "summary": "Calvin Harris (born Adam Richard Wiles; January 17,  1984 in Dumfries, Scotland), is a Scottish singer, songwriter and record producer. He was born and grew up in Dumfries, Scotland. His interest in electronic music surfaced in his early teenage years, producing his first bedroom demo by the age of 15. \n\nHis first album I Created Disco was released on 18 June 2007. The album contained up-tempo electroclash songs that were influenced by music from the 1980s. <a href=\"https://www.last.fm/music/Calvin+Harris\">Read more on Last.fm</a>", "listeners": "1876580", "playcount": "56828025"}, {"name": "The Chainsmokers", "url": "https://www.last.fm/music/The+Chainsmokers", "image": "https://lastfm-img2.akamaized.net/i/u/174s/92790aa04b4556388c51611801d950c7.png", "mbid_artist": "91a81925-92f9-4fc9-b897-93cf01226282", "summary": "The Chainsmokers are a disc jockey/producer duo consisting of Andrew Taggart (born in 1990) and Alex Pall (born in 1985) from New York City, United States. \n\nAndrew Taggart was born in Portland, ME. He was a member of the Love Team. Alex Pall was born in 1985 in New York City. Pall studied art at New York University, while Taggart studied at Syracuse University. In 2012, they came together as a DJ duo. The Chainsmokers formed as electronic dance music producer DJs in 2012 under the management company 4AM in New York City. <a href=\"https://www.last.fm/music/The+Chainsmokers\">Read more on Last.fm</a>", "listeners": "438972", "playcount": "5386200"}, {"name": "Arctic Monkeys", "url": "https://www.last.fm/music/Arctic+Monkeys", "image": "https://lastfm-img2.akamaized.net/i/u/174s/bdcd8f568e28403cbb762562b697c767.png", "mbid_artist": "ada7a83c-e3e1-40f1-93f9-3e73dbc9298a", "summary": "Arctic Monkeys are an indie rock band formed in Sheffield, South Yorkshire, England in 2002 after meeting at Stocksbridge High School. The band consists of Alex Turner (vocals, guitar), Jamie Cook (guitar), Nick O'Malley (backing vocals, bass) and Matt Helders (drums, vocals). Founding bassist Andy Nicholson left in 2006.\n\nThe band has released five studio albums, \"Whatever People Say I Am, That's What I'm Not\" (2006), \"Favourite Worst Nightmare\" (2007) <a href=\"https://www.last.fm/music/Arctic+Monkeys\">Read more on Last.fm</a>", "listeners": "3247364", "playcount": "292900838"}, {"name": "Adele", "url": "https://www.last.fm/music/Adele", "image": "https://lastfm-img2.akamaized.net/i/u/174s/492cd86d2808cf796c72130da2e06595.png", "mbid_artist": "cc2c9c3c-b7bc-4b8b-84d8-4fbd8779e493", "summary": " Adele Laurie Blue Adkins, (born 5 May 1988), is a Grammy Award-Winning English singer-songwriter from Enfield, North London. Her debut album, 19, was released in January 2008 and entered the UK album chart at #1. The album has since received four-times Platinum certification in the UK and has sold 5,500,000 copies worldwide. The album included the hugely popular song Chasing Pavements. 19 earned Adele two Grammy Awards in February 2009 for Best New Artist and Best Female Pop Vocal Performance.  <a href=\"https://www.last.fm/music/Adele\">Read more on Last.fm</a>", "listeners": "2644032", "playcount": "114853726"}, {"name": "Queen", "url": "https://www.last.fm/music/Queen", "image": "https://lastfm-img2.akamaized.net/i/u/174s/b104102c3cb64b298915f4d1773fd1bd.png", "mbid_artist": "420ca290-76c5-41af-999e-564d7c71f1a7", "summary": "Queen were an English rock band originally consisting of four members: vocalist Freddie Mercury, guitarist Brian May, bass guitarist John Deacon, and drummer Roger Taylor.\n\nThe band formed in London in 1970 after May and Taylor's former band Smile split after having released an album and single. Freddie replaced lead vocalist Tim Staffell, after the latter's departure from the original trio. \n\nThere was much deliberation as to what the band's name would be. <a href=\"https://www.last.fm/music/Queen\">Read more on Last.fm</a>", "listeners": "3700401", "playcount": "160595275"}, {"name": "Ariana Grande", "url": "https://www.last.fm/music/Ariana+Grande", "image": "https://lastfm-img2.akamaized.net/i/u/174s/b6dffeb4e8c5503d6ae1ccbc728130be.png", "mbid_artist": "f4fdbb4c-e4b7-47a0-b83b-d91bbfcfa387", "summary": "Ariana Grande (born Ariana Grande-Butera, June 26, 1993 in Boca Raton, Florida, United States), is an American Grammy award-nominated actress, singer, and songwriter. Beginning by taking a part in the Broadway musical 13 in 2008, Grande later landed the role Cat Valentine on the Nickelodeon hit TV shows Victorious (2010-2013), and its spin off, Sam & Cat (2013-2014).\n\nGrande reached mainstream success in March 2013 after her debut single \"The Way\" (featuring Mac Miller) from her debut studio album Yours Truly (2013) <a href=\"https://www.last.fm/music/Ariana+Grande\">Read more on Last.fm</a>", "listeners": "703959", "playcount": "32529371"}, {"name": "Pink Floyd", "url": "https://www.last.fm/music/Pink+Floyd", "image": "https://lastfm-img2.akamaized.net/i/u/174s/8ece33d486e4be46ce1d533bc91d0cb9.png", "mbid_artist": "83d91898-7763-47d7-b03b-b92132375c47", "summary": "Pink Floyd are a psychedelic/progressive rock band formed in Cambridge, England, United Kingdom in 1965. Pink Floyd is one of rock's most successful and influential acts, having sold over 200 million albums worldwide and with 74.5 million certified units in the United States, making them one of the best-selling artists of all time. Currently the band consists of David Gilmour (vocals, guitar) and Nick Mason (drums).\n\nThe band's classic lineup was Roger Waters (vocals <a href=\"https://www.last.fm/music/Pink+Floyd\">Read more on Last.fm</a>", "listeners": "2851125", "playcount": "280857750"}, {"name": "Frank Ocean", "url": "https://www.last.fm/music/Frank+Ocean", "image": "https://lastfm-img2.akamaized.net/i/u/174s/d48ee8f148783679d9d933d0948e4e7b.png", "mbid_artist": "e520459c-dff4-491d-a6e4-c97be35e0044", "summary": "Frank Ocean (born October 28, 1987) is an American singer/songwriter and member of the gleefully hedonistic hip-hop collective OFWGKTA. He was born Christopher \"Lonny\" Breaux in New Orleans, Louisiana, and now resides in Beverly Hills. He has helped pen tracks for Justin Bieber, John Legend, Brandy, and Beyonce Knowles over the last few years. In 2011, Ocean released his debut mixtape, Nostalgia, Ultra, for free via his Tumblr.\n\nVenting about his decision to drop the record his own way, he took to Twitter on March 1, 2011: \"i. <a href=\"https://www.last.fm/music/Frank+Ocean\">Read more on Last.fm</a>", "listeners": "956248", "playcount": "42833513"}, {"name": "Metallica", "url": "https://www.last.fm/music/Metallica", "image": "https://lastfm-img2.akamaized.net/i/u/174s/8a0202265ec642c6bcae358cbb05e9dd.png", "mbid_artist": "65f4f0c5-ef9e-490c-aee3-909e7ae6b2ab", "summary": "Metallica is an American metal band formed in 1981 in Los Angeles, California, United States when drummer Lars Ulrich posted an advertisement in The Recycler. Metallica’s line-up originally consisted of Ulrich, rhythm guitarist and vocalist James Hetfield, and lead guitarist Dave Mustaine. Mustaine was later fired due to problems with alcoholism and drug addiction - he went on to form the band Megadeth. Exodus guitarist Kirk Hammett took his place. <a href=\"https://www.last.fm/music/Metallica\">Read more on Last.fm</a>", "listeners": "2698534", "playcount": "250759743"}, {"name": "Lady Gaga", "url": "https://www.last.fm/music/Lady+Gaga", "image": "https://lastfm-img2.akamaized.net/i/u/174s/5afee80be9e170494ea8e3341a9ea2a4.png", "mbid_artist": "650e7db6-b795-4eb5-a702-5ea2fc46c848", "summary": "Stefani Joanne Angelina Germanotta (born March 28, 1986), who performs under the stage name Lady Gaga, is a singer, songwriter and musician from New York City, New York, United States. \n\nBefore Gaga adopted her stage name she was in a band called Stefani Germanotta Band. She released her first EP, “Red and Blue\", in early 2006. The following year, music producer Rob Fusari dubbed her Lady Gaga, inspired by the Queen song \"Radio Gaga\". After this she recorded her first two songs as Lady Gaga (Fever  and Wonderful) on Def Jam records <a href=\"https://www.last.fm/music/Lady+Gaga\">Read more on Last.fm</a>", "listeners": "3535443", "playcount": "234535973"}, {"name": "Tame Impala", "url": "https://www.last.fm/music/Tame+Impala", "image": "https://lastfm-img2.akamaized.net/i/u/174s/b76c4ac1718d4f33aabbb0096a1cc67e.png", "mbid_artist": "63aa26c3-d59b-4da4-84ac-716b54f1ef4d", "summary": "Tame Impala is a psychedelic rock band from Perth, Australia. It is the project of Kevin Parker who writes and records almost all of the music by himself. The live band consists of Kevin Parker (lead guitar and vocals), Dominic Simper (guitar and synth), Jay Watson (synth and backing vocals), Julien Barbagallo (drums), Nick Allbrook (ex-bassist) who decided to leave the band mid 2013 and is now being replaced by their close friend, Cam Avery (from POND). <a href=\"https://www.last.fm/music/Tame+Impala\">Read more on Last.fm</a>", "listeners": "884303", "playcount": "51877562"}, {"name": "Nirvana", "url": "https://www.last.fm/music/Nirvana", "image": "https://lastfm-img2.akamaized.net/i/u/174s/b93401bb105d404fb36fc999affeb700.png", "mbid_artist": "9282c8b4-ca0b-4c6b-b7e3-4f7762dfc4d6", "summary": "There are several artists named 'Nirvana';\n\n1) Nirvana was an American grunge band. The band formed in Aberdeen, Washington in 1987, and it was part of the Seattle grunge scene of the late 80s, alongside bands like Pearl Jam, Alice in Chains and Soundgarden. As their popularity rose, alternative rock became a dominant genre on American and Canadian radio and music television during the early-to-mid '90s.\n\nIn late 1987, Cobain and Novoselic recruited drummer Aaron Burckhard (1987–1988). <a href=\"https://www.last.fm/music/Nirvana\">Read more on Last.fm</a>", "listeners": "4043847", "playcount": "203932320"}, {"name": "DJ Snake", "url": "https://www.last.fm/music/DJ+Snake", "image": "https://lastfm-img2.akamaized.net/i/u/174s/887ccf8faf7cf7a8671fb1647486b686.png", "mbid_artist": "31445b1e-96f3-4c7f-84ec-dd02e647e690", "summary": "William Grigahcine, better known by his stage name DJ Snake, is a French DJ, rapper and producer mixing hip hop and electronic music.\n\nHe is a Grammy-nominated producer and artist who debuted into the international scene with singles \"Bird Machine\" and \"Turn Down for What\" in 2013. \"Bird Machine\" is a collaboration with fellow French act Alesia. The single was picked up by Mad Decent, a Los Angeles-based record label run by Diplo, and released in February 2013. <a href=\"https://www.last.fm/music/DJ+Snake\">Read more on Last.fm</a>", "listeners": "352396", "playcount": "2991619"}, {"name": "Daft Punk", "url": "https://www.last.fm/music/Daft+Punk", "image": "https://lastfm-img2.akamaized.net/i/u/174s/9fd718d4c80e4ac89107c6c0bb908440.png", "mbid_artist": "056e4f3e-d505-4dad-8ec1-d04f521cbb56", "summary": "Daft Punk  is a multi Grammy Award-winning electronic music duo formed in 1994 in Paris, France, and consisting of French musicians Thomas Bangalter (born 3 January 1975) and Guy-Manuel de Homem-Christo (born 8 February 1974). The band is considered one of the most successful electronic music collaborations of all time, both in album sales and in critical acclaim. \n\nDaft Punk reached significant popularity in the late 90s house movement in France, along with other artists such as Air, Cassius, and Dimitri From Paris. <a href=\"https://www.last.fm/music/Daft+Punk\">Read more on Last.fm</a>", "listeners": "3584257", "playcount": "193952240"}, {"name": "Florence + the Machine", "url": "https://www.last.fm/music/Florence+%252B+the+Machine", "image": "https://lastfm-img2.akamaized.net/i/u/174s/ddd4e2e9710d1524e145003ed9ae83fa.png", "mbid_artist": "5fee3020-513b-48c2-b1f7-4681b01db0c6", "summary": "Florence + the Machine (a stylisation of Florence and The Machine), is a London, UK, art pop band led by singer-songwriter Florence Welch and formed in 2007.  The band consists of:  Florence Welch (vocals), Robert Ackroyd (guitar), Isabella Summers (aka Isa Machine - keyboards), Tom Monger (harp), Mark Saunders (bass, percussion), Christopher Lloyd Hayden (drums, backing vocals), Rusty Bradshaw (keyboard, backing vocals) and Sam White (backing vocals).   <a href=\"https://www.last.fm/music/Florence+%252B+the+Machine\">Read more on Last.fm</a>", "listeners": "2223856", "playcount": "151032089"}, {"name": "Lana Del Rey", "url": "https://www.last.fm/music/Lana+Del+Rey", "image": "https://lastfm-img2.akamaized.net/i/u/174s/8bd9f3f3dfae4b44cb24f498386a2ff4.png", "mbid_artist": "b7539c32-53e7-4908-bda3-81449c367da6", "summary": "Elizabeth \"Lizzy\" Grant (born 21 June 1986), better known as Lana Del Rey, is a singer-songwriter from Lake Placid, New York, United States.  Del Rey is known for embellishing her songs and music videos with an eerily nostalgic vibe heavy on Americana themes, including images of surfing, Coney Island, Frank Sinatra, and Marilyn Monroe.  She has also listed a large number of her artistic influences, including Allen Ginsberg, Elvis Presley, Britney Spears <a href=\"https://www.last.fm/music/Lana+Del+Rey\">Read more on Last.fm</a>", "listeners": "1610776", "playcount": "166320679"}, {"name": "Bon Iver", "url": "https://www.last.fm/music/Bon+Iver", "image": "https://lastfm-img2.akamaized.net/i/u/174s/2e9fad9ae4d94bb8bf11d10e78ad53ae.png", "mbid_artist": "437a0e49-c6ae-42f6-a6c1-84f25ed366bc", "summary": "Bon Iver is a Grammy Award winning indie folk band from Eau Claire, Wisconsin, United States, and one of Justin Vernon's current and most notable music projects to date. The band also consists of Mike Noyce, Sean Carey and Matt MacCaughan. \n\nThe name 'Bon Iver' (pronounced \"bon ee-VAIR\") is a play on the French phrase 'bon hiver' meaning 'good winter'. Vernon independently released Bon Iver's debut album For Emma, Forever Ago in 2007, most of which was recorded during a four-month stay in a remote cabin in Wisconsin. <a href=\"https://www.last.fm/music/Bon+Iver\">Read more on Last.fm</a>", "listeners": "1809664", "playcount": "103478516"}, {"name": "Muse", "url": "https://www.last.fm/music/Muse", "image": "https://lastfm-img2.akamaized.net/i/u/174s/f4d1efa9148acda1007cbdacba3202ac.png", "mbid_artist": "fd857293-5ab8-40de-b29e-55a69d4e4d0f", "summary": "Muse are an alternative rock band from Teignmouth, England, United Kingdom. The band consists of Matthew Bellamy on lead vocals, piano, keyboard and guitar, Chris Wolstenholme on backing vocals and bass guitar, and Dominic Howard on drums and percussion.  \n\nThey have been friends since their formation in early 1994 and changed band names a number of times (such as Gothic Plague, Fixed Penalty, and Rocket Baby Dolls) before adopting the name Muse. Since the release of their fourth album <a href=\"https://www.last.fm/music/Muse\">Read more on Last.fm</a>", "listeners": "3912179", "playcount": "321008432"}, {"name": "Beyoncé", "url": "https://www.last.fm/music/Beyonc%C3%A9", "image": "https://lastfm-img2.akamaized.net/i/u/174s/47ced6cbf3e88b0f2e0503c2bcbf557c.png", "mbid_artist": "859d0860-d480-4efd-970c-c05d5f1776b8", "summary": "Beyoncé (born Beyoncé Giselle Knowles, September 4, 1981) is an American pop/RnB singer, songwriter, record producer, actress and model. Beyoncé was named Billboard's Top Female Artist of the 2000s in February 2009 as well as their Artist of the Millennium in May 2011. She was the RIAA's top certified and best-selling overall artist of the decade and the NRJ Music Awards also awarded her as their Artist of the Decade in France. She is one of the most influential artists of the century with record sales surpassing 130 million. <a href=\"https://www.last.fm/music/Beyonc%C3%A9\">Read more on Last.fm</a>", "listeners": "3309931", "playcount": "134315532"}, {"name": "Britney Spears", "url": "https://www.last.fm/music/Britney+Spears", "image": "https://lastfm-img2.akamaized.net/i/u/174s/0b6201afdece1eb73934593da338c37a.png", "mbid_artist": "45a663b5-b1cb-4a91-bff6-2bef7bbfdd76", "summary": "Britney Jean Spears (born on December 2, 1981 in Kentwood, LA, United States, and raised in Kentwood, Louisiana, United States) is a Grammy-winning multi-platinum American pop singer, songwriter, dancer and occasional actress. She debuted in 1998 with her single ...Baby One More Time. She is one of the most influential and popular post-2000 icons of music. Spears is one of the few young musicians to appear on lists of best selling music acts of all-time. She also holds several world records. <a href=\"https://www.last.fm/music/Britney+Spears\">Read more on Last.fm</a>", "listeners": "3030326", "playcount": "177616113"}, {"name": "Led Zeppelin", "url": "https://www.last.fm/music/Led+Zeppelin", "image": "https://lastfm-img2.akamaized.net/i/u/174s/a9b30b1f754d4e7198ca1d5cdc469c9e.png", "mbid_artist": "d6e0e274-8e19-44ce-b5b2-52c12f8a674a", "summary": "Led Zeppelin were an English rock band originally formed in 1968 by guitarist Jimmy Page under the name \"The New Yardbirds\", based on Page's previous band, The Yardbirds. The band formed when Jimmy Page (guitar) recruited Robert Plant (vocals, harmonica), John Paul Jones (bass guitar, keyboards, mandolin), and John Bonham (drums). With their heavy, guitar-driven blues-rock sound, Led Zeppelin are regularly cited as one of the progenitors of heavy metal and hard rock music. <a href=\"https://www.last.fm/music/Led+Zeppelin\">Read more on Last.fm</a>", "listeners": "2710128", "playcount": "164158519"}, {"name": "Justin Timberlake", "url": "https://www.last.fm/music/Justin+Timberlake", "image": "https://lastfm-img2.akamaized.net/i/u/174s/3db3576f14c5448d8cd897a868b3b16a.png", "mbid_artist": "596ffa74-3d08-44ef-b113-765d43d12738", "summary": "Justin Timberlake (born Justin Randall Timberlake; January 31, 1981 in Memphis, Tennessee) is a Grammy Award winning singer, Emmy Award winning actor, producer and dancer. \n\nAt a young age of 4, Timberlake already had a love for music. Joining singing competitions as early as age 7, he was coached by well-renowned child coach Bob Westbrook. After an appearance on Star Search, he continued his dreams, beating out thousands of kids to join the cast of Disney's Mickey Mouse Club. <a href=\"https://www.last.fm/music/Justin+Timberlake\">Read more on Last.fm</a>", "listeners": "2592524", "playcount": "64810198"}, {"name": "The Rolling Stones", "url": "https://www.last.fm/music/The+Rolling+Stones", "image": "https://lastfm-img2.akamaized.net/i/u/174s/26c047d31b694f518eeaa7cb2d63c4ad.png", "mbid_artist": "b071f9fa-14b0-4217-8e97-eb41da73f598", "summary": "The Rolling Stones are an English rock group that formed in London in 1962. First popular in Europe, they quickly became successful in North America during the \"British Invasion\" of the mid-60s. Since then, their worldwide sales are estimated at more than 200 million albums. In 1989, they were inducted into the Rock and Roll Hall of Fame, and in 2004, they ranked number 4 in Rolling Stone magazine's 100 Greatest Artists of All Time. In 2008, Billboard <a href=\"https://www.last.fm/music/The+Rolling+Stones\">Read more on Last.fm</a>", "listeners": "3582171", "playcount": "137931621"}, {"name": "Green Day", "url": "https://www.last.fm/music/Green+Day", "image": "https://lastfm-img2.akamaized.net/i/u/174s/2bbbcdc5b3a5a4e0a6f6dfbe6d209cbd.png", "mbid_artist": "084308bd-1654-436f-ba03-df6697104e19", "summary": "Green Day is an American punk rock band formed in 1987. The band consists of lead vocalist and guitarist Billie Joe Armstrong, bassist and backing vocalist Mike Dirnt, drummer Tré Cool and guitarist and backing vocalist Jason White, who became a full member after playing in the band as a session and touring guitarist for 13 years. Cool replaced former drummer John Kiffmeyer in 1990, prior to the recording of the band's second studio album, Kerplunk (1992). <a href=\"https://www.last.fm/music/Green+Day\">Read more on Last.fm</a>", "listeners": "3516345", "playcount": "172028509"}, {"name": "Ellie Goulding", "url": "https://www.last.fm/music/Ellie+Goulding", "image": "https://lastfm-img2.akamaized.net/i/u/174s/3de9c01bcde6490fc9b19d24e4d030e7.png", "mbid_artist": "33ca19f4-18c8-4411-98df-ac23890ce9f5", "summary": "Ellie Goulding (born Elena Jane Goulding, 30 December 1986 in Hereford, England) is an English singer-songwriter. Born in Hereford, she grew up in Kington, Herefordshire and currently lives in London, England.\n\nAfter studying drama at the University of Kent for a couple of years, Goulding moved to West London for the purpose of developing her songs and music career. Touring since 2008 she released her debut single \"Under the Sheets\" on 15 November 2009. <a href=\"https://www.last.fm/music/Ellie+Goulding\">Read more on Last.fm</a>", "listeners": "1742171", "playcount": "74571145"}, {"name": "Eminem", "url": "https://www.last.fm/music/Eminem", "image": "https://lastfm-img2.akamaized.net/i/u/174s/07f1cd2beb3f4d579ca3f50385006db5.png", "mbid_artist": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "summary": "Marshall Bruce Mathers III (born October 17, 1972),  better known by his stage name Eminem/Slim Shady is an American rapper and record producer.  Eminem learned his trade while growing up in Detroit, United States, and quickly gained popularity in 1999 with his major-label album, The Slim Shady LP, which won a Grammy Award for Best Rap Album. The following album, The Marshall Mathers LP, became the fastest-selling solo album in the United States history. <a href=\"https://www.last.fm/music/Eminem\">Read more on Last.fm</a>", "listeners": "4210278", "playcount": "172412635"}, {"name": "Bastille", "url": "https://www.last.fm/music/Bastille", "image": "https://lastfm-img2.akamaized.net/i/u/174s/ece54fc8e4f78635da865e2eea42ca2d.png", "mbid_artist": "fefe1208-5d8c-48a7-9b6c-2f5ffb62b063", "summary": "There are at least two bands with the name Bastille.\n\n1: is rock group from South London\n2: is a dubstep producer\n\n1:\nBastille is a rock group from South London, England that formed in 2010. Bastille started out as a solo project by singer-songwriter Dan Smith, who later decided to form a band. The quartet consists of Dan Smith, Chris 'Woody' Wood, Will Farquarson and Kyle Simmons. The name of the band comes from Bastille Day, which was the day when Smith was born. <a href=\"https://www.last.fm/music/Bastille\">Read more on Last.fm</a>", "listeners": "880769", "playcount": "31677856"}, {"name": "Kings of Leon", "url": "https://www.last.fm/music/Kings+of+Leon", "image": "https://lastfm-img2.akamaized.net/i/u/174s/dc16a4fa847b4c829af88fadb782133c.png", "mbid_artist": "6ffb8ea9-2370-44d8-b678-e9237bbd347b", "summary": "Kings of Leon is an American rock band that formed in Nashville, Tennessee, United States in 1999, consisting of brothers Anthony \"Caleb\" Followill (lead vocals, rhythm guitar), Ivan \"Nathan\" Followill (drums, percussion, backing vocals) and Michael \"Jared\" Followill (bass guitar, backing vocals), with their cousin Cameron \"Matthew\" Followill (lead guitar, backing vocals). Each member of the family group is known by their middle name (second given name) as opposed to their first given name. <a href=\"https://www.last.fm/music/Kings+of+Leon\">Read more on Last.fm</a>", "listeners": "3260693", "playcount": "159290190"}, {"name": "Tove Lo", "url": "https://www.last.fm/music/Tove+Lo", "image": "https://lastfm-img2.akamaized.net/i/u/174s/cd501642732464db124a09650de0bee7.png", "mbid_artist": "56756959-1e78-429c-b897-e1d056cb0225", "summary": "Tove Lo is the stage name of Ebba Tove Elsa Nilsson (born 29 October 1987 in Stockholm, Sweden), a pop singer and songwriter. She has also written songs for a number of artists, including Icona Pop, Girls Aloud, Ellie Goulding, and Cher Lloyd. Her stage name (pronounced here) is a combination of her real name and the Swedish word for \"lynx\", a childhood nickname.\n\nTove grew up in the Stockholm suburb of Djursholm. She studied at the music school Rytmus Musikergymnasiet. <a href=\"https://www.last.fm/music/Tove+Lo\">Read more on Last.fm</a>", "listeners": "543950", "playcount": "12940947"}, {"name": "OneRepublic", "url": "https://www.last.fm/music/OneRepublic", "image": "https://lastfm-img2.akamaized.net/i/u/174s/011ecb59ddc9cb16b4743d286ce4b0fe.png", "mbid_artist": "c33c2065-b1c3-4406-b066-d33a9e2ea71a", "summary": "OneRepublic is an American, self-proclaimed \"genreless\", band formed in Colorado Springs in 2002 by Ryan Tedder and Zach Filkins. After a few years of moderate success, they have since drawn mainstream attention with the release of their single \"Apologize,\" which has sold in excess of 7 million singles worldwide.  The song, according to SoundScan Data, is one of only two songs that have reached 3 million legal downloads in history.  A remix of \"Apologize\" was featured on Timbaland's Shock Value and the band's debut album <a href=\"https://www.last.fm/music/OneRepublic\">Read more on Last.fm</a>", "listeners": "2070323", "playcount": "54688102"}, {"name": "Imagine Dragons", "url": "https://www.last.fm/music/Imagine+Dragons", "image": "https://lastfm-img2.akamaized.net/i/u/174s/4e5a70fe523c4cc0cc4fb9d52232a64b.png", "mbid_artist": "012151a8-0f9a-44c9-997f-ebd68b5389f9", "summary": "Imagine Dragons is a Grammy award-winning alternative rock band which formed in 2008 in Las Vegas, Nevada, United States. The band consists of Dan Reynolds (vocals), Wayne Sermon (guitar), Ben McKee (bass) and Daniel Platzman (drums). The band released four EPs - \"Imagine Dragons\" (2009), \"Hell and Silence\" (2010), \"It's Time\" (2011) and \"Continued Silence\" (2012) - before releasing their debut full length album \"Night Visions\" on 4 September 2012. <a href=\"https://www.last.fm/music/Imagine+Dragons\">Read more on Last.fm</a>", "listeners": "1327474", "playcount": "55118128"}, {"name": "The Killers", "url": "https://www.last.fm/music/The+Killers", "image": "https://lastfm-img2.akamaized.net/i/u/174s/666067b3089b4bb38701a407fcd238f3.png", "mbid_artist": "95e1ead9-4d31-4808-a7ac-32c3614c116b", "summary": "There are at least five artists which use, or have used, this name:\n1) an American rock band from Las Vegas, Nevada, formed in 2001\n2) a Uruguayan rock band from the early 1970s\n3) an American hardcore band from Chicago, IL, from the 1990s\n4) an American band from Cleveland, Ohio, from the 1980s\n5) a British punk rock band from the 1970s\n6) An American doo wop group from the 1950s\n\n1. The Killers is an American rock band from Las Vegas, Nevada, formed in 2001 and consist of Brandon Flowers (vocals <a href=\"https://www.last.fm/music/The+Killers\">Read more on Last.fm</a>", "listeners": "4199541", "playcount": "191740965"}, {"name": "Shawn Mendes", "url": "https://www.last.fm/music/Shawn+Mendes", "image": "https://lastfm-img2.akamaized.net/i/u/174s/7c4bd702cb27347641eb2a7e11d4249d.png", "mbid_artist": "b7d92248-97e3-4450-8057-6fe06738f735", "summary": "Shawn Mendes (born Shawn Peter Raul Mendes; August 8, 1998 in Toronto, Ontario, Canada) is a Canadian singer-songwriter. Since the release of his self-titled The Shawn Mendes EP and his debut single \"Life of the Party\", he has been gaining mainstream success as a singer-songwriter and touring artist.\n\nMendes was born in Toronto, Ontario, Canada and was raised in Pickering, a suburb of the city. He is the son of Karen, a real estate agent, and Manuel Mendes, a businessman. <a href=\"https://www.last.fm/music/Shawn+Mendes\">Read more on Last.fm</a>", "listeners": "293887", "playcount": "4660488"}, {"name": "The Cure", "url": "https://www.last.fm/music/The+Cure", "image": "https://lastfm-img2.akamaized.net/i/u/174s/04201e62f0e24351ba50e08028bf2758.png", "mbid_artist": "69ee3720-a7cb-4402-b48d-a02c366f2bcf", "summary": "The Cure are a rock band which formed in 1976 in Crawley, England, United Kingdom. The band originally consisted of Robert Smith (vocals, guitar), Porl Thompson (guitar), Michael Dempsey (bass) and Lol Tolhurst (drums), with the band's lineup overgoing several changes throughout the years and Smith remaining as the only constant member throughout the band's history. The band currently consists of Smith (vocals, guitar), Simon Gallup (bass), Roger O'Donnell (keyboards), Jason Cooper (drums) and Reeves Gabrels (guitar). <a href=\"https://www.last.fm/music/The+Cure\">Read more on Last.fm</a>", "listeners": "2749003", "playcount": "139822806"}, {"name": "Foo Fighters", "url": "https://www.last.fm/music/Foo+Fighters", "image": "https://lastfm-img2.akamaized.net/i/u/174s/97eaf8805a4b411e995b826292836890.png", "mbid_artist": "67f66c07-6e61-4026-ade5-7e782fad3a5d", "summary": "Foo Fighters are an American rock band formed by singer/guitarist/drummer Dave Grohl in 1995 in Seattle, USA. Grohl formed the group as a one-man project after the dissolution of his previous band Nirvana in 1994. Prior to the release of Foo Fighters in 1995, Grohl drafted Nate Mendel (bass), William Goldsmith (drums) (both of Sunny Day Real Estate and The Fire Theft), and Pat Smear (guitar) (of The Germs) to complete the group. Goldsmith left during the recording of the group's second album The Colour and the Shape (1997) <a href=\"https://www.last.fm/music/Foo+Fighters\">Read more on Last.fm</a>", "listeners": "3830506", "playcount": "178345897"}, {"name": "Ed Sheeran", "url": "https://www.last.fm/music/Ed+Sheeran", "image": "https://lastfm-img2.akamaized.net/i/u/174s/f7cf3018a7934aa8ca5fa2ec6cf5dae6.png", "mbid_artist": "b8a7c51f-362c-4dcb-a259-bc6e0095f0a6", "summary": "Ed Sheeran (born 17 February 1991) is a singer songwriter currently signed under Atlantic (WMG). Sheeran was born in Halifax, West Yorkshire before moving to Framlingham, Suffolk. In his time in Suffolk, he was known to have flourished as a hidden talent when it came to music. He learned guitar at a very young age, and began writing songs during his time at Thomas Mills High School in Framlingham. By the time Sheeran had left school, he was already certain that music was going to play a major part in his life <a href=\"https://www.last.fm/music/Ed+Sheeran\">Read more on Last.fm</a>", "listeners": "1261924", "playcount": "56453914"}, {"name": "Linkin Park", "url": "https://www.last.fm/music/Linkin+Park", "image": "https://lastfm-img2.akamaized.net/i/u/174s/742df950c2d64448b004fd225ed8b13f.png", "mbid_artist": "f59c5520-5f46-4d2c-b2c4-822eabf53419", "summary": "Linkin Park is an American band from Agoura Hills, California. Formed in 1996, the band rose to international fame with their debut album, Hybrid Theory, which was certified Diamond by the RIAA in 2005 and multi-platinum in several other countries. Its following studio album, Meteora, continued the band's success, topping the Billboard 200 album chart in 2003, and was followed by extensive touring and charity work around the world. In 2003, MTV2 named <a href=\"https://www.last.fm/music/Linkin+Park\">Read more on Last.fm</a>", "listeners": "3731760", "playcount": "261103899"}, {"name": "Flume", "url": "https://www.last.fm/music/Flume", "image": "https://lastfm-img2.akamaized.net/i/u/174s/f21878c938e3d38d68349de635bf976b.png", "mbid_artist": "35fd8d42-b4a6-4414-9827-8766bd0daa3c", "summary": "Flume is an electronic music project, created by Harley Streten from Sydney, Australia. Streten was discovered and signed by Future Classic in 2011, after submitting the tracks \"Sleepless\", \"Over You\" and \"Paper Thin\" in an original artists competition managed by the Australian record company. Nathan McLay, an employee of Future Classic and now Flume's manager, assisted with the release of his first EP titled Sleepless , which contained the three original tracks. <a href=\"https://www.last.fm/music/Flume\">Read more on Last.fm</a>", "listeners": "521062", "playcount": "14441869"}]